nxp-mcuxpresso/mcuxsdk-examples/_boards/kw47evk/demo_apps/lin_stack/master/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLinLpuart
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLinLpuart(void)
{
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_GpioC);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Config: Peripheral clocks are enabled; module does not stall low power mode entry */
    CLOCK_EnableClock(kCLOCK_PortC);

    gpio_pin_config_t LIN_SLP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PTC7 (pin 45)  */
    GPIO_PinInit(BOARD_INITLINLPUART_LIN_SLP_GPIO, BOARD_INITLINLPUART_LIN_SLP_PIN, &LIN_SLP_config);

    const port_pin_config_t porta16_pin11_config = {/* Internal pull-up/down resistor is disabled */
                                                    (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    (uint16_t)kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    (uint16_t)kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPUART0_RX */
                                                    (uint16_t)kPORT_MuxAlt6,
                                                    /* Does not invert */
                                                    (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    (uint16_t)kPORT_UnlockRegister};
    /* PORTA16 (pin 11) is configured as LPUART0_RX */
    PORT_SetPinConfig(PORTA, 16U, &porta16_pin11_config);

    const port_pin_config_t porta17_pin12_config = {/* Internal pull-up/down resistor is disabled */
                                                    (uint16_t)kPORT_PullDisable,
                                                    /* Low internal pull resistor value is selected. */
                                                    (uint16_t)kPORT_LowPullResistor,
                                                    /* Fast slew rate is configured */
                                                    (uint16_t)kPORT_FastSlewRate,
                                                    /* Passive input filter is disabled */
                                                    (uint16_t)kPORT_PassiveFilterDisable,
                                                    /* Open drain output is disabled */
                                                    (uint16_t)kPORT_OpenDrainDisable,
                                                    /* Low drive strength is configured */
                                                    (uint16_t)kPORT_LowDriveStrength,
                                                    /* Normal drive strength is configured */
                                                    (uint16_t)kPORT_NormalDriveStrength,
                                                    /* Pin is configured as LPUART0_TX */
                                                    (uint16_t)kPORT_MuxAlt6,
                                                    /* Does not invert */
                                                    (uint16_t)kPORT_InputNormal,
                                                    /* Pin Control Register fields [15:0] are not locked */
                                                    (uint16_t)kPORT_UnlockRegister};
    /* PORTA17 (pin 12) is configured as LPUART0_TX */
    PORT_SetPinConfig(PORTA, 17U, &porta17_pin12_config);

    const port_pin_config_t LIN_SLP = {/* Internal pull-up/down resistor is disabled */
                                       (uint16_t)kPORT_PullDisable,
                                       /* Low internal pull resistor value is selected. */
                                       (uint16_t)kPORT_LowPullResistor,
                                       /* Fast slew rate is configured */
                                       (uint16_t)kPORT_FastSlewRate,
                                       /* Passive input filter is disabled */
                                       (uint16_t)kPORT_PassiveFilterDisable,
                                       /* Open drain output is disabled */
                                       (uint16_t)kPORT_OpenDrainDisable,
                                       /* Low drive strength is configured */
                                       (uint16_t)kPORT_LowDriveStrength,
                                       /* Normal drive strength is configured */
                                       (uint16_t)kPORT_NormalDriveStrength,
                                       /* Pin is configured as PTC7 */
                                       (uint16_t)kPORT_MuxAsGpio,
                                       /* Does not invert */
                                       (uint16_t)kPORT_InputNormal,
                                       /* Pin Control Register fields [15:0] are not locked */
                                       (uint16_t)kPORT_UnlockRegister};
    /* PORTC7 (pin 45) is configured as PTC7 */
    PORT_SetPinConfig(BOARD_INITLINLPUART_LIN_SLP_PORT, BOARD_INITLINLPUART_LIN_SLP_PIN, &LIN_SLP);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
